/*7. Напишите программу, которая принимает на вход
трёхзначное число и на выходе показывает последнюю цифру
этого числа. */

System.Console.WriteLine("Введите трехзначное число");
int num = int.Parse(Console.ReadLine());

System.Console.WriteLine (num % 10);


/*int index = 2;
System.Console.WriteLine("Введите трехзначное число");
string num = (Console.ReadLine());

System.Console.WriteLine (num [2]);
*/