//Напишите программу, которая на вход
//принимает число и выдаёт его квадрат (число
//умноженное на само себя).


/*System.Console.Write("Введите число ");
int number = Int32.Parse(Console.ReadLine());
int res = number * number;
System.Console.WriteLine(res);
*/
System.Console.WriteLine("Введите число: ");
int n = int.Parse(Console.ReadLine()); 


System.Console.WriteLine("Число:" + n);
System.Console.WriteLine("Квадрат числа:" + n * n);


